---
kind: method
id: M:Autodesk.Revit.DB.Viewport.HasViewportTransforms
source: html/474169c5-2e94-ed0b-95e2-851d96dd3723.htm
---
# Autodesk.Revit.DB.Viewport.HasViewportTransforms Method

Indicates if the viewport has transforms.

## Syntax (C#)
```csharp
public bool HasViewportTransforms()
```

## Returns
True if the viewport has transforms, false otherwise.

## Remarks
Not all viewports have transforms. For example,
 viewports for schedules and legends do not have transforms.